OpenFOAM_Maincode/tutorials/XiFluid/moriyoshiHomogeneous/moriyoshiHomogeneous/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default             none;

    div(phi,U)          Gauss limitedLinearV 1;

    div(phi,ft_b_ha_hau) Gauss multivariateSelection
    {
        fu  limitedLinear01 1;
        ft  limitedLinear01 1;
        b   limitedLinear01 1;
        ha  limitedLinear 1;
        hau limitedLinear 1;
    };

    div(phi,K)          Gauss limitedLinear 1;
    div(phi,(p|rho))    Gauss upwind;

    div(phiXi,Xi)       Gauss limitedLinear 1;
    div(phiSt,b)        Gauss limitedLinear01 1;

    div(U)              Gauss linear;
    div((Su*n))         Gauss linear;
    div((U+((Su*Xi)*n))) Gauss linear;

    div(phi,k)          Gauss limitedLinear 1;
    div(phi,epsilon)    Gauss limitedLinear 1;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear uncorrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         uncorrected;
}


// ************************************************************************* //
